const mockedData = [
  {
    page: 'main',
    label: '',
    heading: 'КАФЕДРА ТЕОРИИ И ПРАКТИКИ КИТАЙСКОГО ЯЗЫКА',
    description: {
      main:
        'Факультет китайского языка и культуры, Минский Государственный Лингвистический Университет',
      features: {
        title: '',
        info: '',
      },
    },
    details: {
      title: '',
      info: '',
      contacts: {
        address: {
          place: '',
          room: '',
        },
        email: '',
      },
    },
    materials: [{ name: '', info: '', docs: [] }],
    news: [
      {
        photo: '',
        title: '',
        description: '',
      },
    ],
    teacherInfo: [
      {
        name: '',
        info: {},
      },
    ],
  },
  {
    page: 'about',
    label: 'О кафедре',
    heading: 'Кафедра создана 01 января 2018 года (Приказ № 268)',
    description: {
      main:
        'Подготовка осуществляется по специальностям 21 06 01 01 «Современные иностранные языки (преподавание)», 21 06 01 02 «Современные иностранные языки (перевод)», 23 01 02 «Лингвистическое обеспечение межкультурной коммуникации»',
      features: {
        title: 'Особенности обучения',
        info:
          'На кафедре преподают как белорусские преподаватели, так и носители китайского языка.',
      },
    },
    details: {
      title: 'Зав. кафедрой теории и практики китайского языка:',
      info:
        'Гордей Александр Николаевич, доктор филологических наук, профессор',
      contacts: {
        address: {
          place: 'Каб.:',
          room: ' В-313',
        },
        mail: {
          name: 'E-mail:',
          email: 'chineselang@mslu.by',
        },
      },
    },
    materials: [{ name: '', info: '', docs: [] }],
    news: [
      {
        photo: '',
        title: '',
        description: '',
      },
    ],
    teacherInfo: [
      {
        name: '',
        info: {},
      },
    ],
  },
  {
    page: 'teachers',
    label: 'Преподаватели',
    heading:
      'В этом разделе вы найдете информацию о профессорско-преподавательском составе кафедры',
    description: {
      main: '',
      features: {
        title: '',
        info: '',
      },
    },
    details: {
      title: '',
      info: '',
      contacts: {
        address: {
          place: '',
          room: '',
        },
        mail: {
          name: '',
          email: '',
        },
      },
    },
    materials: [{ name: '', info: '', docs: [] }],
    news: [
      {
        photo: '',
        title: '',
        description: '',
      },
    ],
    teacherInfo: [
      {
        name: 'Сыч Анастасия Сергеевна',
        photo: 'src/icons/teachers/Sych.jpg',
        info: {
          position: 'Преподаватель кафедры теории и практики китайского языка',
          degrees: 'Окончила факультет китайского языка и культуры Минского государственного лингвистического университета в 2019 году с отличием по специальности «современные иностранные языки (преподавание)», специализация «русский как иностранный»',
          subjects: 'Ведет практические занятия по дисциплинам «Практика иноязычного общения», «Социокультурные основы речевого общения», «Практика китайского речевого общения». ',
          about: '',
          publications: [{}],
          constacts: {
            email: 'stacey.sych@gmail.com',
            mobile: '+375291306780',
            telegram: '+375291306780',
            whatsApp: '',
            facebook: '',
          },
        },
      },
      {
        name: 'Евменова Дарья Андреевна',
        photo: 'src/icons/teachers/Evmenova.jpg',
        info: {
          position: 'Преподаватель кафедры теории и практики китайского языка.',
          degrees: 'В 2019 году окончила факультет китайского языка и культуры Минского государственного лингвистического университета году по специальности «современные иностранные языки (преподавание)», специализация «русский как иностранный». В 2020 году окончила магистратуру году по специальности «Теоритическая и прикладная лингвистика», специализация «Теория языка».',
          subjects: 'Специализируется на преподавании предметов «Практика устной и письменной речи», «Практика устной и письменной речи (чтение)», «Техника письма».',
          about: '',
          publications: [{}],
          constacts: {
            email: 'evmenova.dasha@mail.ru',
            mobile: '',
            telegram: '',
            whatsApp: '',
            facebook: '',
          },
        },
      },
      {
        name: 'Сулима Екатерина Сергеевна',
        photo: 'src/icons/teachers/Sulima.jpg',
        info: {
          position: 'Старший преподаватель кафедры теории и практики китайского языка',
          degrees: 'В 2016 году с отличием окончила факультет английского языка Минского государственного лингвистического университета по направлению специальности «Современные иностранные языки (преподавание)», специализации «Русский как иностранный» с присвоением квалификации «Лингвист. Преподаватель китайского и английского языков. Преподаватель русского языка как иностранного». В 2019 году окончила магистратуру МГЛУ по специальности «Сравнительно-историческое, типологическое и сопоставительное языкознание».',
          subjects: 'Специализируется на преподавании предметов «Практика устной и письменной речи китайского языка», «Практика иноязычного общения», «Социокультурные основы речевого общения», «Практика китайского речевого общения». Является руководителем практики студентов 3, 4 и 5 курсов.',
          about: 'В 2012 году участвовала в летних курсах для студентов стран-участниц и партнеров по диалогу ШОС (г. Шанхай, КНР). В 2013-2014гг. проходила обучение в Яньшаньском университете (г. Циньхуандао, пров. Хэбей, КНР).',
          publications: [{}],
          constacts: {
            email: 'sulima.katerina@yandex.by',
            mobile: '',
            telegram: '',
            whatsApp: '',
            facebook: '',
          },
        },
      },
    ],
  },
];

export default mockedData;
