const mockedData = [
  {
    page: 'main',
    label: '',
    heading: 'КАФЕДРА ТЕОРИИ И ПРАКТИКИ КИТАЙСКОГО ЯЗЫКА',
    description: {
      main:
        'Факультет китайского языка и культуры, Минский Государственный Лингвистический Университет',
      features: {
        title: '',
        info: '',
      },
    },
    details: {
      title: '',
      info: '',
      contacts: {
        address: {
          place: '',
          room: '',
        },
        mail: {
          name: '',
          email: '',
        },
        mobile: '',
      },
    },
  },
  {
    page: 'about',
    label: 'О кафедре',
    heading: 'Кафедра создана 01 января 2018 года (Приказ № 268)',
    description: {
      main:
        'Подготовка осуществляется по специальностям 21 06 01 01 «Современные иностранные языки (преподавание)», 21 06 01 02 «Современные иностранные языки (перевод)», 23 01 02 «Лингвистическое обеспечение межкультурной коммуникации»',
      features: {
        title: 'Особенности обучения',
        info:
          'На кафедре преподают как белорусские преподаватели, так и носители китайского языка.',
      },
    },
    details: {
      title: 'Зав. кафедрой теории и практики китайского языка:',
      info:
        'Гордей Александр Николаевич, доктор филологических наук, профессор',
      contacts: {
        address: {
          place: 'Каб.:',
          room: ' В-313',
        },
        mail: {
          name: 'E-mail:',
          email: 'chineselang@mslu.by',
        },
        mobile: '+375 29 674 66 88',
      },
    },
  },
  {
    page: 'teachers',
    label: 'Преподаватели',
    heading:
      'В этом разделе вы найдете информацию о профессорско-преподавательском составе кафедры',
    description: {
      main: '',
      features: {
        title: '',
        info: '',
      },
    },
    teacherInfo: [
      {
        name: 'Гордей Александр Николаевич',
        photo: 'src/icons/teachers/Gordei.jpg',
        info: {
          position: 'Заведующий кафедрой теории и практики китайского языка.',
          degrees: 'Доктор филологических наук (1999), профессор (2005).',
          subjects: 'Ведет практические занятия по дисциплинам «Практика устной и письменной речи», "Теория перевода", "Типологии родного и иностранного языка", "Теоретическая рграмматика".',
          about: 'Гордей Александр Николаевич, 1965 г. р., доктор филологических наук (1999), профессор (2005), заведующий кафедрой теории и практики китайского языка Минского государственного лингвистического университета, профессор кафедры языкознания и страноведения Востока Белорусского государственного университета, главный научный сотрудник Центра системного анализа и стратегических исследований Национальной академии наук Беларуси. Специалист в области формальной семантики, информатики, искусственного интеллекта, китайского языка и востоковедения. Создатель Белорусской ассоциации востоковедов «Тайген» (1995), кафедры языкознания и страноведения Востока (1996), Республиканского института китаеведения им. Конфуция (2006), кафедры теории и практики китайского языка Минского государственного лингвистического университета (2018). Член Совета по востоковедению и африканистике Московского государственного университета (2007), иностранный член Совета Всекитайского фонда развития образования КНР (2016), член Совета Международной конфуцианской ассоциации (2020). Автор 80 научных работ на русском, английском и китайском языках.',
          publications: [{
            title: 'Hardzei, A. Plagiarism Problem Solving based on Combinatory Semantics / A. Hardzei = Гордей, А.Н. Проблема плагиата сквозь призму комбинаторной семантики / А.Н. Гордей (на англ. яз.)',
            published: 'Communications in Computer and Information Science (CCIS). ‒ Switzerland: Springer Nature Switzerland AG, 2020. – Vol. 1282. – P. 176–197.',
          },
          {
            title: 'Гордей, А.Н. Теория автоматического порождения архитектуры знаний: ТАПАЗ-2 = Theory for Automatic Generation of Knowledge Architecture: TAPAZ-2 / А. Н. Гордей; пер. с рус. И. М. Бойко. – Rev. English edn. – Минск : РИВШ, 2017. – 50 с. (на англ. яз.)',
            published: 'Республиканский институт высшей школы, 2017'
          },
          {
            title: 'Гордей, А.Н. Принципы исчисления семантики предметных областей / А.Н. Гордей. Автореф. дисс... доктора филол. наук. Москва, 1998. – 30 с.',
            published: 'Издательский центр Белгосуниверситета, 1998'
          },
          {
            title: 'Гордей, А.Н. Теория автоматического порождения архитектуры знаний (ТАПАЗ-2) и дальнейшая минимизация семантических исчислений / А.Н. Гордей',
            published: 'Открытые семантические технологии проектирования интеллектуальных систем = Open Semantic Technologies for Intelligent Systems (OSTIS-2014): материалы IV Междунар. науч.-техн. конф., Минск, 20-22 февраля 2014 г. / редкол.: В.В. Голенков (отв. ред.) [и др.]. ‒ Минск: БГУИР, 2014. ‒ С. 49-64.'
          },
          {
            title: 'Гордей, А.Н. Семантическое пространство в факториале теории автоматического порождения архитектуры знаний: ТАПАЗ-2 [Электронный ресурс] / А.Н. Гордей',
            published: 'Информационные системы и технологии: материалы Междунар. конгресса по информатике (CSIST 2016) (г. Минск, 24–27 окт. 2016 г.) / Белорус. гос. ун-т. – Минск, 2016. – С. 543–547.'
          },
        ],
          constacts: {
            email: 'alieks2001@gmail.com',
            mobile: '+375 29 674 66 88',
            telegram: '',
            whatsApp: '',
            facebook: '',
            website: 'http://tapaz.by',
          },
        },
      },
      {
        name: 'Сыч Анастасия Сергеевна',
        photo: 'src/icons/teachers/Sych.jpg',
        info: {
          position: 'Преподаватель кафедры теории и практики китайского языка',
          degrees: 'Окончила факультет китайского языка и культуры Минского государственного лингвистического университета в 2019 году с отличием по специальности «современные иностранные языки (преподавание)», специализация «русский как иностранный»',
          subjects: 'Ведет практические занятия по дисциплинам «Практика иноязычного общения», «Социокультурные основы речевого общения», «Практика китайского речевого общения». ',
          about: '',
          publications: [{}],
          constacts: {
            email: 'stacey.sych@gmail.com',
            mobile: '+375291306780',
            telegram: '+375291306780',
            whatsApp: '',
            facebook: '',
            website: '',
          },
        },
      },
      {
        name: 'Евменова Дарья Андреевна',
        photo: 'src/icons/teachers/Evmenova.jpg',
        info: {
          position: 'Преподаватель кафедры теории и практики китайского языка.',
          degrees: 'В 2019 году окончила факультет китайского языка и культуры Минского государственного лингвистического университета году по специальности «современные иностранные языки (преподавание)», специализация «русский как иностранный». В 2020 году окончила магистратуру году по специальности «Теоритическая и прикладная лингвистика», специализация «Теория языка».',
          subjects: 'Специализируется на преподавании предметов «Практика устной и письменной речи», «Практика устной и письменной речи (чтение)», «Техника письма».',
          about: '',
          publications: [{}],
          constacts: {
            email: 'evmenova.dasha@mail.ru',
            mobile: '',
            telegram: '',
            whatsApp: '',
            facebook: '',
            website: '',
          },
        },
      },
      {
        name: 'Сулима Екатерина Сергеевна',
        photo: 'src/icons/teachers/Sulima.jpg',
        info: {
          position: 'Старший преподаватель кафедры теории и практики китайского языка',
          degrees: 'В 2016 году с отличием окончила факультет английского языка Минского государственного лингвистического университета по направлению специальности «Современные иностранные языки (преподавание)», специализации «Русский как иностранный» с присвоением квалификации «Лингвист. Преподаватель китайского и английского языков. Преподаватель русского языка как иностранного». В 2019 году окончила магистратуру МГЛУ по специальности «Сравнительно-историческое, типологическое и сопоставительное языкознание».',
          subjects: 'Специализируется на преподавании предметов «Практика устной и письменной речи китайского языка», «Практика иноязычного общения», «Социокультурные основы речевого общения», «Практика китайского речевого общения». Является руководителем практики студентов 3, 4 и 5 курсов.',
          about: 'В 2012 году участвовала в летних курсах для студентов стран-участниц и партнеров по диалогу ШОС (г. Шанхай, КНР). В 2013-2014гг. проходила обучение в Яньшаньском университете (г. Циньхуандао, пров. Хэбей, КНР).',
          publications: [{}],
          constacts: {
            email: 'sulima.katerina@yandex.by',
            mobile: '',
            telegram: '',
            whatsApp: '',
            facebook: '',
            website: '',
          },
        },
      },
    ],
  },
];

export default mockedData;
